tap "common-fate/granted"
tap "felixkratz/formulae"
tap "gentleman-programming/tap", "https://github.com/Gentleman-Programming/homebrew-tap"
tap "homebrew/bundle"
tap "homebrew/services"
tap "iina/mpv-iina"
tap "janosmiko/tap"
tap "keidarcy/tap"
tap "manudiv16/eaws"
tap "nikitabobko/aerospace", "https://github.com/nikitabobko/homebrew-tap.git"
tap "nikitabobko/tap"
tap "siderolabs/tap"
# Automate deployment, configuration, and upgrading
brew "ansible"
# CLI tool to build, test, debug, and deploy Serverless applications using AWS SAM
brew "aws-sam-cli"
# Official Amazon AWS command-line interface
brew "awscli"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Validate CloudFormation templates against the CloudFormation spec
brew "cfn-lint"
# Cross-platform make
brew "cmake"
# Container runtimes on MacOS (and Linux) with minimal setup
brew "colima", restart_service: :changed
# GNU File, Shell, and Text utilities
brew "coreutils"
# Container Signing
brew "cosign"
# Tool for interacting with remote images and registries
brew "crane"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Isolated development environments using Docker
brew "docker-compose"
# Platform keystore credential helper for Docker
brew "docker-credential-helper"
# Embeddable SQL OLAP Database Management System
brew "duckdb"
# Simple command-line tool for creating clusters on Amazon EKS
brew "eksctl"
# Functional metaprogramming aware language built on Erlang VM
brew "elixir"
# Serial flasher utility for Espressif SoCs and modules based on esptool.py
brew "espflash"
# Open-source framework for augmenting humans using AI
brew "fabric-ai"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Command-line tools for fly.io services
brew "flyctl"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Tool for glamorous shell scripts
brew "gum"
# Kubernetes package manager
brew "helm"
# Agent multiplexer that lives in your terminal
brew "herdr"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Kubernetes CLI To Manage Your Clusters In Style!
brew "k9s"
# Tool that can switch between kubectl contexts easily and create aliases
brew "kubectx"
# Kubernetes command-line interface
brew "kubernetes-cli"
# Template-free customization of Kubernetes YAML manifests
brew "kustomize"
# Powerful, lightweight programming language
brew "lua"
# Run a Kubernetes cluster locally
brew "minikube"
# Deep clean and optimize your Mac
brew "mole"
# Open source relational database management system
brew "mysql-client"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Retrieves currently playing media, and simulates media actions
brew "nowplaying-cli"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# AI coding agent, built for the terminal
brew "opencode", link: false
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Password manager
brew "pass"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Fast, disk space efficient package manager
brew "pnpm"
# Object-relational database system
brew "postgresql@14"
# Framework for managing multi-language pre-commit hooks
brew "pre-commit"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Python interface to Tcl/Tk
brew "python-tk@3.13"
# Python interface to Tcl/Tk
brew "python-tk@3.9"
# Generic machine emulator and virtualizer
brew "qemu"
# Powerful, clean, object-oriented scripting language
brew "ruby", link: false
# Powerful, clean, object-oriented scripting language
brew "ruby@3.1"
# Powerful, clean, object-oriented scripting language
brew "ruby@3.3"
# Smart session manager for the terminal
brew "sesh"
# Easy and Repeatable Kubernetes Development
brew "skaffold"
# Editor of encrypted files
brew "sops"
# Change macOS audio source from the command-line
brew "switchaudio-osx"
# General purpose fuzzy finder TUI
brew "television"
# OpenTofu / Terraform / Terragrunt / Terramate / Atmos version manager
brew "tenv", link: false
# Tool to generate documentation from Terraform modules
brew "terraform-docs"
# Terraform version manager inspired by rbenv
brew "tfenv"
# Terminal multiplexer
brew "tmux"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Blazing fast terminal file manager written in Rust, based on async I/O
brew "yazi"
# Pluggable terminal workspace, with terminal multiplexer as the base feature
brew "zellij"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Real-time type-ahead completion for Zsh
brew "zsh-autocomplete"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Lightning Fast Kubernetes navigator - keyboard-focused TUI for managing K8s clusters
brew "janosmiko/tap/lfk", trusted: true
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Desktop password and login vault
cask "bitwarden"

# Universal database tool and SQL client
cask "dbeaver-community"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-meslo-lg-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-victor-mono"
cask "font-victor-mono-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
# AI-powered productivity tool for the command-line
cask "kiro-cli"
# GPU-based terminal emulator
# Simple application that will prevent iTunes or Apple Music from launching
cask "notunes"
# Control your tools with a few keystrokes
cask "raycast"
# Plugin for AWS CLI to start and end sessions that connect to managed instances
cask "session-manager-plugin"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Screenshot measurement and annotation tool
cask "shottr"
# Music streaming service
cask "spotify"

# GPU-accelerated cross-platform terminal emulator and multiplexer
cask "wezterm"
go "github.com/spf13/cobra-cli"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "github.com/golang-migrate/migrate/v4/cmd/migrate"
go "honnef.co/go/tools/cmd/staticcheck"
go "github.com/swaggo/swag/cmd/swag"
go "github.com/mrmarble/zmk-viewer/cmd/zmk-viewer"
cargo "diesel_cli"
uv "graphifyy", with: ["mcp"]
npm "@anthropic-ai/claude-code"
npm "@earendil-works/pi-coding-agent"
npm "@google/gemini-cli"
npm "@kilocode/cli"
npm "ergogen"
npm "grafana-mcp-analyzer"
npm "serverless"
